app/controllers/wikis_controller.rb

  def index
      if ! current_user.present? || current_user.standard?
          @wikis = Wiki.where(private: false)
          return
      end
      @wikis = Wiki.all
---
SELECT "wikis".* FROM "wikis" WHERE "wikis"."private" = ?  [["private", "t"]]
SELECT "wikis".* FROM "wikis"

  def show
    @wiki = Wiki.find(params[:id])
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 0]]

  def create

    @wiki = Wiki.new(wiki_params)

    @wiki.user = current_user

    begin
         authorize @wiki
     rescue => error
        puts "in here..."
        binding.pry
        puts error.message

        if ! current_user.present?
            alert = "You must be logged in to create a wiki"
        elsif current_user.standard? && @wiki.private
            alert = "You are not authorized to create private wikis"
        else
            alert = "You are not authorized to do that, for some reason"
        end
        flash[:alert] = alert
       redirect_to action: :index
       return
     end

     if @wiki.save!
---
INSERT INTO "wikis" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Blah blah blah"], ["body", "blah blah blah blah blah "], ["user_id", 8], ["created_at", "2017-05-16 21:47:00.856101"], ["updated_at", "2017-05-16 21:47:00.856101"]]

  def edit
      @wiki = Wiki.find(params[:id])
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", nil]]

  def update
     @wiki = Wiki.find(params[:id])
     begin
         authorize @wiki
     rescue
        flash[:alert] = "You must be logged in to edit this Wiki."
       redirect_to @wiki
       return
     end
     @wiki.assign_attributes(wiki_params)

     if @wiki.save
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "wikis" SET "body" = ?, "updated_at" = ? WHERE "wikis"."id" = ?  [["body", "Blah blah blah blah blah blah blah\r\n\r\nand more blahs."], ["updated_at", "2017-05-04 10:22:45.683118"], ["id", 3]]

  def destroy
     @wiki = Wiki.find(params[:id])

     if @wiki.destroy
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "wikis" WHERE "wikis"."id" = ?  [["id", 1]]